{
  "appName": "Planix",
  "lastUpdated": "26 Octobre 2025",
  "sections": [
    {
      "title": "1. Informations que nous collectons",
      "subsections": [
        {
          "title": "1.1 Données personnelles",
          "content": "Planix ne collecte pas directement vos données personnelles telles que votre nom, adresse ou numéro de téléphone. La seule donnée d’identification provient de votre compte Google lorsque vous vous connectez pour activer la sauvegarde sur Google Drive (adresse e-mail, identifiant utilisateur, autorisations Drive). Ces informations ne sont ni partagées, ni vendues, ni stockées sur un serveur tiers."
        },
        {
          "title": "1.2 Données locales",
          "content": "L’application stocke localement vos événements, préférences d’affichage, historiques de sauvegarde et statistiques. Ces données ne quittent jamais votre appareil."
        },
        {
          "title": "1.3 Données de sauvegarde",
          "content": "Si vous choisissez la sauvegarde sur Google Drive, Planix crée un dossier privé dans votre espace Drive et y enregistre vos sauvegardes chiffrées. L’application n’a accès qu’à ces fichiers et vous pouvez les supprimer à tout moment."
        }
      ]
    },
    {
      "title": "2. Comment nous utilisons vos informations",
      "content": "Les données sont utilisées uniquement pour enregistrer, restaurer et synchroniser vos événements, gérer vos préférences et effectuer les sauvegardes Drive. Aucune donnée n’est partagée à des fins publicitaires ou analytiques."
    },
    {
      "title": "3. Stockage et sécurité des données",
      "content": "Les données locales sont stockées en sécurité sur votre appareil. Les sauvegardes Google Drive sont protégées par OAuth 2.0. Planix ne transmet aucune donnée à ses propres serveurs."
    },
    {
      "title": "4. Authentification Google",
      "content": "Planix utilise Google Sign-In pour vérifier votre identité et obtenir les autorisations Drive. Aucune donnée sensible (mot de passe, jeton d’accès) n’est conservée."
    },
    {
      "title": "5. Thèmes et personnalisation",
      "content": "Vos préférences de thème (clair/sombre) et de langue sont enregistrées uniquement localement sur votre appareil."
    },
    {
      "title": "6. Langues",
      "content": "Planix est disponible en français et en anglais. Aucune donnée linguistique n’est envoyée à un serveur externe."
    },
    {
      "title": "7. Statistiques locales",
      "content": "Les graphiques et historiques sont générés localement à partir de vos données. Aucune donnée d’utilisation n’est collectée."
    },
    {
      "title": "8. Vos droits",
      "content": "Vous pouvez supprimer vos données locales, supprimer vos fichiers Planix dans Google Drive et révoquer les autorisations de Planix dans votre compte Google à tout moment.",
      "links": [
        {
          "label": "Gérer les autorisations Google",
          "url": "https://myaccount.google.com/permissions"
        }
      ]
    },
    {
      "title": "9. Contact",
      "content": "Pour toute question ou demande liée à la confidentialité, contactez-nous à donaldnkouathio@gmail.com."
    },
    {
      "title": "10. Modifications de cette politique",
      "content": "Toute modification sera publiée sur cette page avec une nouvelle date de mise à jour. Nous vous encourageons à la consulter régulièrement."
    },
    {
      "title": "11. Consentement",
      "content": "En utilisant Planix, vous acceptez cette politique de confidentialité."
    }
  ],
  "summary": {
    "events": {
      "storage": "Sur votre appareil",
      "shared": false
    },
    "googleDrive": {
      "storage": "Votre Drive personnel",
      "shared": false
    },
    "preferences": {
      "storage": "Localement sur votre appareil",
      "shared": false
    },
    "googleAccount": {
      "usage": "Connexion et sauvegarde",
      "shared": false
    }
  }
}
